In [30]:
import pandas as pd
from sqlalchemy import create_engine, text

DATABASE_URI = "postgresql://postgres:123@localhost:5432/social"

engine = create_engine(DATABASE_URI)

In [31]:
df = pd.read_sql_table('app_social_socialuser',engine)
df

,id,password,last_login,is_superuser,email,username,full_name,city,state,location,is_staff,is_active,role
0,1,pbkdf2_sha256$870000$kBIyKviesTPuTZHWdE0Bn6$qc...,2025-01-07 11:40:53.597205+00:00,False,Nikhil1@gmail.com,Nikhil_12,Nikhil,mumbai,Maharashtra,"mumbai, Maharashtra",False,True,Author
1,2,pbkdf2_sha256$870000$n7YFfcz95gcOeVwkIgGnkI$RW...,2025-01-07 11:47:08.884086+00:00,False,example2@gmail.com,admin11,Admin,Ghatkopar,Maharashtra,"Ghatkopar, Maharashtra",False,True,Author
2,3,pbkdf2_sha256$870000$LKSjqKWJvib7ASoEvuhrQa$Sm...,2025-01-07 12:05:17.037621+00:00,False,Abc3@gmail.com,Abc123,Abc,mumbai,Maharashtra,"mumbai, Maharashtra",False,True,Author
3,4,pbkdf2_sha256$870000$YlEZYdFemREIN696YdISad$LT...,2025-01-08 09:07:46.594945+00:00,False,Rohit3@gmail.com,Rohit12,Rohit,mumbai,Maharashtra,"mumbai, Maharashtra",False,True,Seller

In [32]:
sample = pd.read_sql_table('app_social_socialuser',engine,columns=['id','email','username','full_name','role'])
sample

   id               email   username full_name    role
0   1   Nikhil1@gmail.com  Nikhil_12   Nikhil   Author
1   2  example2@gmail.com    admin11     Admin  Author
2   3      Abc3@gmail.com     Abc123       Abc  Author
3   4    Rohit3@gmail.com    Rohit12     Rohit  Seller

In [33]:
def fetch_data():
    with engine.connect() as connection:
        query = text("SELECT * FROM app_social_socialuser")
        result = connection.execute(query)

        for row in result:
            print(row)


if __name__ == "__main__":
    fetch_data()

(1, 'pbkdf2_sha256$870000$kBIyKviesTPuTZHWdE0Bn6$qc7cHGsxQQM/wAAropupd/1OArRXeRIzOVA5khoXcRE=', datetime.datetime(2025, 1, 7, 17, 10, 53, 597205, tzinfo=datetime.timezone(datetime.timedelta(seconds=19800))), False, 'Nikhil1@gmail.com', 'Nikhil_12', 'Nikhil ', 'mumbai', 'Maharashtra', 'mumbai, Maharashtra', False, True, 'Author')
(2, 'pbkdf2_sha256$870000$n7YFfcz95gcOeVwkIgGnkI$RWknPqEQ0+zpEht9ltLe2qZwrAG4SX+kRpmWmP/3Gus=', datetime.datetime(2025, 1, 7, 17, 17, 8, 884086, tzinfo=datetime.timezone(datetime.timedelta(seconds=19800))), False, 'example2@gmail.com', 'admin11', 'Admin', 'Ghatkopar', 'Maharashtra', 'Ghatkopar, Maharashtra', False, True, 'Author')
(3, 'pbkdf2_sha256$870000$LKSjqKWJvib7ASoEvuhrQa$SmIm8uZAEj9RhITVfjse23snafw5CngSziXQSZ8/9RM=', datetime.datetime(2025, 1, 7, 17, 35, 17, 37621, tzinfo=datetime.timezone(datetime.timedelta(seconds=19800))), False, 'Abc3@gmail.com', 'Abc123', 'Abc', 'mumbai', 'Maharashtra', 'mumbai, Maharashtra', False, True, 'Author')
(4, 'pbkdf2_sha256$870000$YlEZYdFemREIN696YdISad$LTsEHxdVOXIYHjdX9/ygGeqIyXmaQgmFn3F2tPZ+LuI=', datetime.datetime(2025, 1, 8, 14, 37, 46, 594945, tzinfo=datetime.timezone(datetime.timedelta(seconds=19800))), False, 'Rohit3@gmail.com', 'Rohit12', 'Rohit', 'mumbai', 'Maharashtra', 'mumbai, Maharashtra', False, True, 'Seller')

In [35]:
from sqlalchemy import create_engine, Column , Integer , String , ForeignKey , text
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import relationship , sessionmaker

url_database = "postgresql://postgres:123@localhost:5432/social"
engine = create_engine(url_database)
Base = declarative_base()
Session = sessionmaker(bind=engine)

Session = Session()
class SocialUser(Base):
    __tablename__ = "app_social_socialuser"
    id = Column(Integer, primary_key=True)
    username = Column(String, nullable=False)


class UserDetails(Base):
    __tablename__ = "user_details"
    id = Column(Integer, primary_key=True)
    social_user_id = Column(Integer, ForeignKey("app_social_socialuser.id"), nullable=False)
    father_name = Column(String)
    school = Column(String)
    education = Column(String)

    social_user = relationship("SocialUser")

def merge_user_data():
    query = text("""  
    SELECT 
        su.id as user_id,
        su.username,
        ud.father_name,
        ud.school,
        ud.education
    FROM app_social_socialuser su
    LEFT JOIN user_details ud ON su.id = ud.social_user_id
 """)
    
    with engine.connect() as connection:
        result = connection.execute(query)

        for row in result:
            print(f"User: {row[1]}, Father: {row[2]}, School: {row[3]}, Education: {row[4]}")


if __name__ == "__main__":
    Base.metadata.create_all(engine)
    print("UserDetails table created.")

    with engine.connect() as connection:
        insert_query = text("""
            INSERT INTO user_details (social_user_id, father_name, school, education)
            VALUES (:social_user_id, :father_name, :school, :education)
        """)
        connection.execute(insert_query, {
            'social_user_id': 1, 
            'father_name': 'John Doe',
            'school': 'Greenwood High School',
            'education': 'High School Diploma'
        })
        print("Sample data added to UserDetails table.")

    
merge_user_data()

C:\Users\chara\AppData\Local\Temp\ipykernel_11828\3076581434.py:7: MovedIn20Warning: The ``declarative_base()`` function is now available as sqlalchemy.orm.declarative_base(). (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  Base = declarative_base()

UserDetails table created.
Sample data added to UserDetails table.
User: admin11, Father: None, School: None, Education: None
User: Rohit12, Father: None, School: None, Education: None
User: Nikhil_12, Father: None, School: None, Education: None
User: Abc123, Father: None, School: None, Education: None

In [36]:
import pandas as pd
data = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9],
    [10, 11, 12],
    [13, 14, 15],
    [16, 17, 18],
    [19, 20, 21],
    [22, 23, 24],
    [25, 26, 27],
    [28, 29, 30]
]

In [37]:
df = pd.DataFrame(data, columns=['A', 'B', 'C'])
df

    A   B   C
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15
5  16  17  18
6  19  20  21
7  22  23  24
8  25  26  27
9  28  29  30

In [39]:
dict_data = {
    'A': [1, 4, 7, 10, 13, 16, 19, 22, 25, 28],
    'B': [2, 5, 8, 11, 14, 17, 20, 23, 26, 29],
    'C': [3, 6, 9, 12, 15, 18, 21, 24, 27, 30]
}
df1 = pd.DataFrame(dict_data)
df1

    A   B   C
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15
5  16  17  18
6  19  20  21
7  22  23  24
8  25  26  27
9  28  29  30

In [43]:
filtered_df = df1[df1['A']>10]
filtered_df

    A   B   C
4  13  14  15
5  16  17  18
6  19  20  21
7  22  23  24
8  25  26  27
9  28  29  30

In [45]:
fillter = df1[(df['A'] > 10) & (df['B'] > 10)]

fillter

    A   B   C
4  13  14  15
5  16  17  18
6  19  20  21
7  22  23  24
8  25  26  27
9  28  29  30

In [46]:
df_repace = df1.replace(10,100)
df_repace

     A   B   C
0    1   2   3
1    4   5   6
2    7   8   9
3  100  11  12
4   13  14  15
5   16  17  18
6   19  20  21
7   22  23  24
8   25  26  27
9   28  29  30

In [47]:
df['A'] = df['A'].replace(10, 100)
print(df)

     A   B   C
0    1   2   3
1    4   5   6
2    7   8   9
3  100  11  12
4   13  14  15
5   16  17  18
6   19  20  21
7   22  23  24
8   25  26  27
9   28  29  30

In [56]:
import numpy as np

data1 = np.random.randint(1, 100, size=(10, 3))
data2 = np.random.randint(1, 100, size=(5, 3))

df1 = pd.DataFrame(data1, columns=['A', 'B', 'C'])
df2 = pd.DataFrame(data2, columns=['A', 'B', 'C'])

# Append df2 to df1
df_combined = pd.concat([df1, df2], ignore_index=True)
print(df_combined)

     A   B   C
0   13  32   4
1   12  94  61
2   30  37  91
3   34  60  88
4   38  57  52
5   77  94  86
6   17  20  99
7    1  92  51
8   39  51  73
9   25  79  64
10  64  71  84
11  99  98  14
12  20  43  80
13  27  21  77
14  80  50  22

In [60]:
from datetime import datetime
data = {
    'int_column': np.random.randint(1, 100, size=5),
    'float_column': np.random.uniform(1, 100, size=5),
    'string_column': ['A', 'B', 'C', 'D', 'E'],
    'date_column': [datetime.now() for _ in range(5)]
}

In [61]:
data_frame = pd.DataFrame(data)
data_frame

   int_column  float_column string_column                date_column
0           8     83.786983             A 2025-01-08 18:03:51.446083
1          39     66.503480             B 2025-01-08 18:03:51.446083
2          15     85.843704             C 2025-01-08 18:03:51.446083
3          90     79.681037             D 2025-01-08 18:03:51.446083
4          97     27.027061             E 2025-01-08 18:03:51.446083

In [65]:
df_sorted = data_frame.sort_values(by=['int_column', 'float_column'], ascending=[True, False])
print(df_sorted)

   int_column  float_column string_column                date_column
0           8     83.786983             A 2025-01-08 18:03:51.446083
2          15     85.843704             C 2025-01-08 18:03:51.446083
1          39     66.503480             B 2025-01-08 18:03:51.446083
3          90     79.681037             D 2025-01-08 18:03:51.446083
4          97     27.027061             E 2025-01-08 18:03:51.446083

In [67]:
data_frame['int_column'] = data_frame['int_column'].apply(lambda x: x * 2)
print(df)

     A   B   C
0    1   2   3
1    4   5   6
2    7   8   9
3  100  11  12
4   13  14  15
5   16  17  18
6   19  20  21
7   22  23  24
8   25  26  27
9   28  29  30

In [68]:
df_dropped_columns = data_frame.drop(columns=['string_column', 'date_column'])
print(df_dropped_columns)

df_dropped_rows = data_frame.drop(index=[0, 1])
print(df_dropped_rows)

   int_column  float_column
0          32     83.786983
1         156     66.503480
2          60     85.843704
3         360     79.681037
4         388     27.027061
   int_column  float_column string_column                date_column
2          60     85.843704             C 2025-01-08 18:03:51.446083
3         360     79.681037             D 2025-01-08 18:03:51.446083
4         388     27.027061             E 2025-01-08 18:03:51.446083

In [71]:
df_with_nans = data_frame.copy()
df_with_nans.loc[0, 'int_column'] = np.nan
df_with_nans.loc[2, 'float_column'] = np.nan

df_filled = df_with_nans.fillna(0)
print(df_filled)

   int_column  float_column string_column                date_column
0         0.0     83.786983             A 2025-01-08 18:03:51.446083
1       156.0     66.503480             B 2025-01-08 18:03:51.446083
2        60.0      0.000000             C 2025-01-08 18:03:51.446083
3       360.0     79.681037             D 2025-01-08 18:03:51.446083
4       388.0     27.027061             E 2025-01-08 18:03:51.446083

In [72]:
df_dropped_na = df_with_nans.dropna()
print(df_dropped_na)

   int_column  float_column string_column                date_column
1       156.0     66.503480             B 2025-01-08 18:03:51.446083
3       360.0     79.681037             D 2025-01-08 18:03:51.446083
4       388.0     27.027061             E 2025-01-08 18:03:51.446083

In [76]:
data_frame['category'] = ['A', 'B', 'A', 'B', 'A']

numeric_cols = data_frame.select_dtypes(include='number').columns

df_grouped = data_frame.groupby('category')[numeric_cols].mean()
print(df_grouped)

          int_column  float_column
category
A              160.0     65.552582
B              258.0     73.092259

In [77]:
df1 = pd.DataFrame({'id': [1, 2, 3], 'name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'id': [1, 2, 3], 'score': [85, 92, 78]})

df_merged = pd.merge(df1, df2, on='id')
print(df_merged)

   id     name  score
0   1    Alice     85
1   2      Bob     92
2   3  Charlie     78

In [78]:
data = {
    'name': ['Alice', 'Bob', 'Alice', 'Bob', 'Alice'],
    'subject': ['Math', 'Math', 'English', 'English', 'Science'],
    'score': [85, 90, 78, 82, 88]
}

df_pivot = pd.DataFrame(data)
pivot_table = pd.pivot_table(df_pivot, values='score', index='name', columns='subject', aggfunc='mean')
print(pivot_table)

subject  English  Math  Science
name
Alice       78.0  85.0     88.0
Bob         82.0  90.0      NaN

In [81]:
df = data_frame.copy()
df['category'] = pd.Categorical(df['category'])
print(df['category'].describe())

count     5
unique    2
top       A
freq      3
Name: category, dtype: object

In [82]:
df['string_column'] = df['string_column'].str.upper()
print(df)

df['string_column'] = df['string_column'].str.replace('A', 'Z')
print(df)

   int_column  float_column string_column                date_column category
0          32     83.786983             A 2025-01-08 18:03:51.446083        A
1         156     66.503480             B 2025-01-08 18:03:51.446083        B
2          60     85.843704             C 2025-01-08 18:03:51.446083        A
3         360     79.681037             D 2025-01-08 18:03:51.446083        B
4         388     27.027061             E 2025-01-08 18:03:51.446083        A
   int_column  float_column string_column                date_column category
0          32     83.786983             Z 2025-01-08 18:03:51.446083        A
1         156     66.503480             B 2025-01-08 18:03:51.446083        B
2          60     85.843704             C 2025-01-08 18:03:51.446083        A
3         360     79.681037             D 2025-01-08 18:03:51.446083        B
4         388     27.027061             E 2025-01-08 18:03:51.446083        A

In [83]:
df_sample = df.sample(n=3)
print(df_sample)

   int_column  float_column string_column                date_column category
2          60     85.843704             C 2025-01-08 18:03:51.446083        A
0          32     83.786983             Z 2025-01-08 18:03:51.446083        A
3         360     79.681037             D 2025-01-08 18:03:51.446083        B